app/controllers/api/v1/first_zombie_apocalypses_controller.rb

  def register_user
    @user = User.new(user_params)

    if @user.save
      @inventory = Inventory.new(user_id: @user.id)
      if @inventory.save
---
INSERT INTO "users" ("name", "age", "gender", "last_location", "infection", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Wendy"], ["age", 18], ["gender", "Female"], ["last_location", "(19,31)"], ["infection", false], ["created_at", "2023-04-10 18:45:47.940535"], ["updated_at", "2023-04-10 18:45:47.940535"]]
INSERT INTO "inventories" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2023-04-10 18:45:47.960452"], ["updated_at", "2023-04-10 18:45:47.960452"]]

  def perform_barter
    #first_user
    user_1 = User.find(params[:first_user][:id])
    items_1 = params[:first_user][:items]
    inventory_1 = user_1.inventory
    #second_user
    user_2 = User.find(params[:second_user][:id])
    items_2 = params[:second_user][:items]
    inventory_2 = user_2.inventory

    unless user_1.infection? || user_2.infection?

      if validate_user_items(user_1, items_1) && validate_user_items(user_2, items_2) && validate_barter(items_1, items_2)

        items_1.each do |item|
          item[:amount].times {
            Inventory.update(user_1, inventory_1, "remove", Item.find_by_name(item[:name]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Comida"], ["LIMIT", 1]]

  def warn_infection
    author = params[:author_id]
    accused = User.find(params[:accused_user_id])
    infection_control = InfectionControl.find_or_create_by(user: accused)

    unless accused.infection?
      unless infection_control.authors.include?(author)

        infection_control.authors << author
        infection_control.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "infection_controls" ("user_id", "authors", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 9], ["authors", "{}"], ["created_at", "2023-04-10 23:54:59.432728"], ["updated_at", "2023-04-10 23:54:59.432728"]]
SELECT "infection_controls".* FROM "infection_controls" WHERE "infection_controls"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
UPDATE "infection_controls" SET "authors" = $1, "updated_at" = $2 WHERE "infection_controls"."id" = $3  [["authors", "{8}"], ["updated_at", "2023-04-10 23:54:59.434522"], ["id", 1]]
UPDATE "users" SET "infection" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["infection", true], ["updated_at", "2023-04-11 00:08:38.934932"], ["id", 18]]

  def set_inventory
    @inventory = Inventory.find_by(user_id: @user.id)
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]