app/controllers/api/v1/first_zombie_apocalypses_controller.rb

SELECT "items".* FROM "items" INNER JOIN "inventory_items" ON "items"."id" = "inventory_items"."item_id" WHERE "inventory_items"."inventory_id" = $1  [["inventory_id", 1]]
INSERT INTO "inventory_items" ("inventory_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["inventory_id", 1], ["item_id", 1], ["created_at", "2023-04-04 01:21:22.949423"], ["updated_at", "2023-04-04 01:21:22.949423"]]
DELETE FROM "inventory_items" WHERE "inventory_items"."inventory_id" = $1 AND "inventory_items"."item_id" = $2  [["inventory_id", 1], ["item_id", 2]]
---
  def update_inventory
    method = params[:method]
    item = Item.find_by_name(params[:item_name])
    user_items = @inventory.items.to_a

    if method === 'add'
      @inventory.items.push(item)
    elsif method === 'remove'
      if user_items.include?(item)
        user_items.delete_at(user_items.index(item))

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
---
  def set_inventory
    @inventory = Inventory.find_by(user_id: @user.id)