app/controllers/api/v1/first_zombie_apocalypses_controller.rb

  def register_user
    @user = User.new(user_params)

    if @user.save
      @inventory = Inventory.new(user_id: @user.id)
      if @inventory.save
---
INSERT INTO "users" ("name", "age", "gender", "last_location", "infection", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Fred"], ["age", nil], ["gender", "Male"], ["last_location", "(1139,26)"], ["infection", false], ["created_at", "2023-03-30 04:02:35.961337"], ["updated_at", "2023-03-30 04:02:35.961337"]]
INSERT INTO "users" ("name", "age", "gender", "last_location", "infection", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "inventories" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 7], ["created_at", "2023-04-05 20:55:10.184439"], ["updated_at", "2023-04-05 20:55:10.184439"]]

  def update_location
    if @user.update(last_location: params[:last_location])
---
UPDATE "users" SET "last_location" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_location", "(27,119)"], ["updated_at", "2023-04-10 22:41:51.323012"], ["id", 10]]

  def update_inventory
    method = params[:method]
    item = Item.find_by_name(params[:item_name])
---
SELECT "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Munição"], ["LIMIT", 1]]

  def perform_barter
    #first_user
    user_1 = User.find(params[:first_user][:id])
    items_1 = params[:first_user][:items]
    inventory_1 = user_1.inventory
    #second_user
    user_2 = User.find(params[:second_user][:id])
    items_2 = params[:second_user][:items]
    inventory_2 = user_2.inventory

    unless user_1.infection? || user_2.infection?

      if validate_user_items(user_1, items_1) && validate_user_items(user_2, items_2) && validate_barter(items_1, items_2)

        items_1.each do |item|
          item[:amount].times {
            Inventory.update(user_1, inventory_1, "remove", Item.find_by_name(item[:name]))
            Inventory.update(user_2, inventory_2, "add", Item.find_by_name(item[:name]))
          }
        end

        items_2.each do |item|
          item[:amount].times {
            Inventory.update(user_2, inventory_2, "remove", Item.find_by_name(item[:name]))
            Inventory.update(user_1, inventory_1, "add", Item.find_by_name(item[:name]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Água"], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Munição"], ["LIMIT", 1]]

  def warn_infection
    author = params[:author_id]
    accused = User.find(params[:accused_user_id])
    infection_control = InfectionControl.find_or_create_by(user: accused)

    unless accused.infection?
      unless infection_control.authors.include?(author)

        infection_control.authors << author
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "infection_controls".* FROM "infection_controls" WHERE "infection_controls"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
INSERT INTO "infection_controls" ("user_id", "authors", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["authors", nil], ["created_at", "2023-04-07 05:27:42.316796"], ["updated_at", "2023-04-07 05:27:42.316796"]]

  def validate_user_items(user, items)
    items.each do |item|
      return false if user.inventory.items.to_a.count(Item.find_by_name(item[:name])) < item[:amount]
---
SELECT "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Medicamentos"], ["LIMIT", 1]]

  def validate_barter(items_1, items_2)
    sum_1 = 0
    sum_2 = 0

    items_1.each do |item|
      sum_1 += Item.find_by_name(item[:name]).value * item[:amount]
    end

    items_2.each do |item|
      sum_2 += Item.find_by_name(item[:name]).value * item[:amount]
---
SELECT "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Munição"], ["LIMIT", 1]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def set_inventory
    @inventory = Inventory.find_by(user_id: @user.id)
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 LIMIT $2  [["user_id", 13], ["LIMIT", 1]]