app/models/inventory.rb

SELECT "items".* FROM "items" INNER JOIN "inventory_items" ON "items"."id" = "inventory_items"."item_id" WHERE "inventory_items"."inventory_id" = $1  [["inventory_id", 5]]
INSERT INTO "inventory_items" ("inventory_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["inventory_id", 4], ["item_id", 1], ["created_at", "2023-04-10 04:23:19.971068"], ["updated_at", "2023-04-10 04:23:19.971068"]]
DELETE FROM "inventory_items" WHERE "inventory_items"."id" = $1  [["id", 203]]
---
  def self.update(user, inventory, method, item)
    @response= {}
    user_items = inventory.items.to_a

    unless user.infection?
      if method === 'add'
        inventory.items.push(item)
      elsif method === 'remove'
        if user_items.include?(item)
          user_items.delete_at(user_items.index(item))