app/models/report.rb

SELECT COUNT(*) FROM "users" WHERE "users"."infection" = $1  [["infection", true]]
SELECT COUNT(*) FROM "users" WHERE "users"."infection" = $1  [["infection", false]]
---
  def self.calc_average_infections
    @data = {}

    @data[:infection] = "#{((User.where(infection: true).count.to_f / User.count.to_f) * 100).to_i}%"
    @data[:uninfection] = "#{((User.where(infection: false).count.to_f / User.count.to_f) * 100).to_i}%"

SELECT "items".* FROM "items"
SELECT "users".* FROM "users" WHERE "users"."infection" = $1  [["infection", false]]
SELECT "items".* FROM "items" INNER JOIN "inventory_items" ON "items"."id" = "inventory_items"."item_id" WHERE "inventory_items"."inventory_id" = $1  [["inventory_id", 2]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "items" INNER JOIN "inventory_items" ON "items"."id" = "inventory_items"."item_id" WHERE "inventory_items"."inventory_id" = $1 AND "items"."id" = $2 LIMIT $3  [["inventory_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def self.calc_average_items_users
    items = Item.all
    users = User.where(infection: false)
    @data = {}
    @response = []

    items.each do |item|
      @data["users_by_#{item.name}"] = 0
      @data["total_#{item.name}"] = 0

      users.each do |user|
        if user.inventory.items.include?(item)

SELECT "users".* FROM "users" WHERE "users"."infection" = $1  [["infection", true]]
SELECT "items"."value" FROM "items" INNER JOIN "inventory_items" ON "items"."id" = "inventory_items"."item_id" WHERE "inventory_items"."inventory_id" = $1  [["inventory_id", 3]]
---
  def self.calc_total_lost
    @result = []
    infected_users = User.where(infection: true)
    infected_users.each do |user|
      total = user.inventory.items.pluck(:value).sum